# Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
# Вам стоит написать программу.
# Винни-Пух считает,что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами.
# Фразы отделяются друг от друга пробелами.
# Стихотворение Винни-Пух вбивает в программу с клавиатуры.
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке.

# Пример№1:
# Ввод: пара-ра-рам рам-пам-папам па-ра-па-дам
# Вывод: парам пам-пам

# Пример№2:
# Ввод: пара-ра-рам рам-пам-папам па-ра-па
# Вывод: пам парам


def rhythm(poem):
    poem = poem.lower().split()
    puh = list()
    for i in poem:
        count = 0
        for j in i:
            if j in 'аеёиоуыэюя':
                count += 1
        puh.append(count)
    for i in range(0,len(puh)-1):
        if puh[i] != puh[i+1]:
            return False
    return True


strinl = "аеёиоуыэюя"
my_poem = input("введите стих: ")
if rhythm(my_poem):
    print("Парам пам-пам")
else:
    print("Пам парам")



